{
    "basics": {
        "name": "Paul Ghattas",
        "website": "http://paulghattas.github.io",
        #"picture": "./headshot-box.jpg",
        "location": {
            "countryCode": "CA",
            "region": "Toronto"
        },
        "profiles": [
            {
                "network": "GitHub",
                "username": "paulghattas",
                "url": "http://github.com/paulghattas"
            },
            {
                "network": "LinkedIn",
                "username": "Paul E. Ghattas",
                "url": "https://www.linkedin.com/in/paulghattas"
            }
        ]
    },
    "work": [
        {
            "company": "Red Hat",
            "position": "Principal Technical Marketing Manager",
            "website": "http://redhat.com",
            "startDate": "2016-09-01",
            "summary": "Lead for technical strategy and direction for ISV partners in the OpenShift ecosystem",
            "highlights": [
                "Worked with partners to architect a technical integration between their products and OpenShift Container Platform across a variety of topics including network plugins, storage plugins, image scanning, runtime security, and containerized product support", 
                "Created and maintained technical assets for the enablement of OpenShift partners and customers, including demo applications, documentation, blog entries, and presentations",
                "Presenter at both conferences (e.g. Red Hat Summit, KubeCon) and live webinars on a variety of topics ranging from overview topics on container and cloud-native development to deep dives on particular technologies and practices"
            ]
        },
        {
            "company": "Red Hat",
            "position": "Principal Software Engineer",
            "website": "http://redhat.com",
            "startDate": "2013-10-31",
            "endDate": "2016-09-01",
            "summary": "Developer and Team Lead for projects related to Red Hat OpenStack with the following responsibilities:",
            "highlights": [
                "Active upstream developer on the Heat project and core developer on the TripleO project",
                "Team Lead for the management API team for Red Hat OpenStack Platform director",
                "Release lead for the Red Hat OpenStack director 9.0 release"
            ]
        },
        {
            "company": "Red Hat",
            "position": "Principal Software Engineer",
            "website": "http://redhat.com",
            "startDate": "2006-07-16",
            "endDate": "2013-09-30",
            "summary": "Team lead for the Pulp project (http://pulpproject.org) with the following responsibilities:",
            "highlights": [
                "Designed the architecture for the v2 iteration, expanding the RPM-centric capabilities of the initial version into a framework for supporting arbitrary types of content. This capability extends to both the admin client, allowing content type contributors to augment the client to support their particular needs, as well as the consumer agent, allowing custom management of consumer-side inventory of the given content type.",
                "Maintained development responsibilities across all aspects of the application, including interactions with MongoDB, REST API design and implementation, client framework and user-visible commands, and a distributed component for load balancing and fault tolerance for consumers utilizing Pulp served content.",
                "Functioned as the team scrum master, including facilitating scrum meetings, leading sprint review/retrospective/planning meetings, and management of the project backlog using Rally.",
                "Product management responsibilities include the creation and maintenance of the project roadmap, and managing the interactions and requirements with four other projects within Red Hat that are using Pulp as the basis of their content management functionality.",
                "Developed and maintained the build process and continuous integration servers.",
                "Significant contributor to the Pulp user guide (http://pulp-user-guide.readthedocs.org), Pulp developer guide and the Pulp developer blog."
            ]
        },
        {
            "company": "Villanova University",
            "position": "Adjunct Professor",
            "website": "http://csc.villanova.edu",
            "startDate": "2008-01-01",
            "summary": "Adjunct professor in the Computer Science department with experience teaching the following courses:",
            "highlights": [
                "CSC4700 - Software Engineering (current)",
                "CSC4790 - Senior Projects (current)",
                "CSC1052 - Algorithms and Data Structures II",
                "CSC2053 - Algorithms and Data Structures III"
            ]
        },
        {
            "company": "Gestalt LLC",
            "position": "Senior Software Engineer",
            "startDate": "2003-12-01",
            "endDate": "2005-12-01",
            "summary": "Technical lead of team of five, utilizing aspects of Agile methodology including overseeing daily standup meetings, planning for rapidly changing requirements, and delivering software in short, feature driven iterations. Project user stories, task scheduling, and time collection is captured using XPlanner. Functioned as a contributing team member, assisting with individual growth and technical understanding of each member of the team.",
            "highlights": [
                "Responsible for all aspects of the development lifecycle, including requirements gathering/documentation, high level architecture, system and component design, implementation, build process creation, testing, and live deployment.",
                "The application is a distributed, clustered web application exposing external services via web services through hand-crafted, WS-I basic profile compliant WSDLs. Data is shared within the cluster through a database access layer developed using Hibernate. Internal message passing is handled through a JMS abstraction to allow components to be started and shutdown independent of knowledge of each other.",
                "Designed and developed reusable, extensible build framework using Apache Ant. The framework serves as a base for each subproject on the contract, providing a standard set of functionality with minimal configuration by each subproject.",
                "Provided on site installation and support for the Joint Forces Command Limited Objective Experiment (JFCOM LOE) through which the application partook in integration tests with similar military software, including the capture and later incorporation of operator feedback."
            ]
        },
        {
            "company": "DTM Systems",
            "position": "Consultant",
            "startDate": "2002-12-01",
            "endDate": "2003-12-01",
            "summary": "Designed, developed, and maintained corporate web site for Subaru of America, including:",
            "highlights": [
                "Integration with Interwoven Teamsite to provide dynamic content to the web site",
                "Implemented JDBC connectivity with Oracle 9.0.2 database",
                "Acted as project manager for J2EE redesign of corporate intranet web site, with responsibilities including requirements gathering, architectural design, implementation, and configuration management duties."
            ]
        },
        {
            "company": "Hewlett-Packard",
            "position": "Software Engineer",
            "startDate": "2001-05-01",
            "endDate": "2002-12-01",
            "highlights": [
                "Developed patches and enhancements for Total-e-Server, HP Application Server and the accompanying J2EE development tool RadPak, specifically in the following areas: CMP mapping file generation, ANT script generation",
                "Provided solutions to customers developing and deploying J2EE applications on HP Application Server, including technical aspects such as EJB, JSP, and JDBC as well as concepts pertaining to design patterns, performance tuning, and overall application design architecture",
                "Provided solutions to customers developing and deploying Web Services-based applications, including complex data type mapping, UDDI registry configuration, and client proxy customization, as well as proper design patterns and integration with J2EE applications",
                "Taught internal seminars regarding advanced Java concepts such as Swing, Threading, Collections, and Networking with a focus on Sun Certification"
            ]
        }
    ],
    "education": [
        {
            "institution": "Drexel University",
            "area": "Software Engineering",
            "studyType": "M.S.",
            "startDate": "2003-09-01",
            "endDate": "2007-05-31"
        },
        {
            "institution": "Villanova University",
            "area": "Computer Science",
            "studyType": "B.S.",
            "startDate": "1997-09-01",
            "endDate": "2001-05-31"
        }
    ],
    "publications": [
        {
            "name": "OpenShift Blog",
            "publisher": "Red Hat",
            "website": "https://blog.openshift.com/author/jdobiesredhat-com/",
            "summary": "A variety of blog posts related to the OpenShift product and its ecosystem."
        }
    ],
    "skills": [
        {
            "name": "Programming (Professional)",
            "keywords": [
                "Python",
                "Java",
                "Javascript",
                "Django",
                "Node.js",
                "React"
            ]
        },
        {
            "name": "Programming (Academic/Hobby)",
            "keywords": [
                "Ruby",
                "Bash",
                "PHP"
            ]
        },
        {
            "name": "Containers & Virtualization",
            "keywords": [
                "OpenShift",
                "Kubernetes",
                "Docker",
                "AWS",
                "OpenStack"
            ]
        },
        {
            "name": "Operating Systems",
            "keywords": [
                "Red Hat Enterprise Linux",
                "Fedora",
                "macOS"
            ]
        }
    ]
}
